//Комисија је кришом одабрала три тајна ненегативна цела броја 
//X
//, 
//Y
// и 
//Z
//, тако да 
//0
//≤
//X
//≤
//Y
//≤
//Z
//.
//
//Да би спречила такмичаре да се докопају ових тајних бројева, Комисија ће уз њих такмичарима саопштити и вредности 
//X
//+
//Y
//, 
//X
//+
//Z
//, 
//Y
//+
//Z
// и 
//X
//+
//Y
//+
//Z
//. Дакле, Комисија ће такмичарима дати седам вредности 
//X
//, 
//Y
//, 
//Z
//, 
//X
//+
//Y
//, 
//X
//+
//Z
//, 
//Y
//+
//Z
// и 
//X
//+
//Y
//+
//Z
// у неком редоследу.
//
//Пронађите 
//X
//, 
//Y
// и 
//Z
//.
//
//Улаз
//У првом и једином реду стандардног улаза налази се седам целих бројева 
//X
//, 
//Y
//, 
//Z
//, 
//X
//+
//Y
//, 
//X
//+
//Z
//, 
//Y
//+
//Z
// и 
//X
//+
//Y
//+
//Z
// у неком произвољном редоследу (тј. први број из стандардног улаза не мора да буде једанк 
//X
//).
//
//Излаз
//У првом и једином реду стандардног излаза, исписати 
//X
//, 
//Y
// и 
//Z
//. Приметите да важи 
//0
//≤
//X
//≤
//Y
//≤
//Z
//.
//
//Пример
//Улаз
//12 8 5 17 9 3 14
//Излаз
//3 5 9
//Објашњење
//На улазу су редом дати бројеви 
//X
//+
//Z
//=
//12
//, 
//X
//+
//Y
//=
//8
//, 
//Y
//=
//5
//, 
//X
//+
//Y
//+
//Z
//=
//17
//, 
//Z
//=
//9
//, 
//X
//=
//3
//, 
//Y
//+
//Z
//=
//14
//
//Ограничења
//0
//≤
//X
//≤
//Y
//≤
//Z
//≤
//10
//8
//Тест примери су подељени у четири дисјунктне групе:
//
//У тестовима вредним 25 поена: 
//0
//=
//X
//=
//Y
//<
//Z
//.
//У тестовима вредним 25 поена: 
//0
//≤
//X
//≤
//Y
//≤
//Z
//<
//100
//.
//У тестовима вредним 25 поена: Бројеви из улаза су дати у неопадајућем редоследу.
//У тестовима вредним 25 поена: Без додатних ограничења.
//Напомена
//Гарантује се да задатак има решење и да је то решење јединствено.

#include <iostream>
#include <algorithm>
#include <vector>
using namespace std;

int main() {
    vector<int> brojevi{2, 14, 7, 5, 10, 12, 22};
    for (int i = 0; i < 7; i++) {
        cin >> brojevi[i];
    }
    sort(brojevi.begin(), brojevi.end());
    int X = brojevi[0];
    int Y = brojevi[1];
    int Z = brojevi[6] - X - Y;
    cout << X << " " << Y << " " << Z << endl;
    return 0;
}
